[
  {
    "id": "1708.09492",
    "title": "Automatically Generating Commit Messages from Diffs using Neural Machine Translation",
    "abstract": "Commit messages are a valuable resource in comprehension of software evolution, since they provide a record of changes such as feature additions and bug repairs. Unfortunately, programmers often neglect to write good commit messages. Different techniques have been proposed to help programmers by automatically writing these messages. These techniques are effective at describing what changed, but are often verbose and lack context for understanding the rationale behind a change. In contrast, humans write messages that are short and summarize the high level rationale. In this paper, we adapt Neural Machine Translation (NMT) to automatically \"translate\" diffs into commit messages. We trained an NMT algorithm using a corpus of diffs and human-written commit messages from the top 1k Github projects. We designed a filter to help ensure that we only trained the algorithm on higher-quality commit messages. Our evaluation uncovered a pattern in which the messages we generate tend to be either very high or very low quality. Therefore, we created a quality-assurance filter to detect cases in which we are unable to produce good messages, and return a warning instead.",
    "arxiv_url": "https://arxiv.org/abs/1708.09492",
    "authors": [
      "Siyuan Jiang",
      "Ameer Armaly",
      "Collin McMillan"
    ],
    "first_author": "Siyuan Jiang",
    "category": [
      "Technical",
      "Benchmark"
    ],
    "field": "Coding Assistant",
    "task": "Code Summarization",
    "tags": [
      "Diff-to-commit translation",
      "Diff-level summarization",
      "Neural Machine Translation for code changes",
      "Verb-Direct-Object filtering",
      "Quality-assurance filter for generation",
      "Attentional RNN encoder-decoder",
      "Human evaluation"
    ],
    "summary": "本文提出将 git diff 作为输入、使用注意力 RNN 的神经机器翻译模型自动生成一行高层次的提交信息，并通过动词-直接宾语过滤与质量保证过滤器在约2M 对提交数据上进行训练与人工评估。",
    "quality": "High",
    "conference": "ASE (IEEE/ACM International Conference on Automated Software Engineering) 2017",
    "pdf_url": "https://arxiv.org/pdf/1708.09492v1",
    "published": "2017-08-30",
    "update_time": "2017-08-30",
    "download_time": "2025-12-11 16:27:07"
  },
  {
    "id": "1709.00103",
    "title": "Seq2SQL: Generating Structured Queries from Natural Language using Reinforcement Learning",
    "abstract": "A significant amount of the world's knowledge is stored in relational databases. However, the ability for users to retrieve facts from a database is limited due to a lack of understanding of query languages such as SQL. We propose Seq2SQL, a deep neural network for translating natural language questions to corresponding SQL queries. Our model leverages the structure of SQL queries to significantly reduce the output space of generated queries. Moreover, we use rewards from in-the-loop query execution over the database to learn a policy to generate unordered parts of the query, which we show are less suitable for optimization via cross entropy loss. In addition, we will publish WikiSQL, a dataset of 80654 hand-annotated examples of questions and SQL queries distributed across 24241 tables from Wikipedia. This dataset is required to train our model and is an order of magnitude larger than comparable datasets. By applying policy-based reinforcement learning with a query execution environment to WikiSQL, our model Seq2SQL outperforms attentional sequence to sequence models, improving execution accuracy from 35.9% to 59.4% and logical form accuracy from 23.4% to 48.3%.",
    "arxiv_url": "https://arxiv.org/abs/1709.00103",
    "authors": [
      "Victor Zhong",
      "Caiming Xiong",
      "Richard Socher"
    ],
    "first_author": "Victor Zhong",
    "category": [
      "Technical",
      "Benchmark"
    ],
    "field": "Coding Assistant",
    "task": "Code Translation",
    "tags": [
      "NL-to-SQL generation",
      "Execution-based policy gradient",
      "Schema-aware pointer decoding",
      "Modeling unordered WHERE conditions",
      "Structured SQL decomposition (aggregation/select/where)"
    ],
    "summary": "本文提出Seq2SQL，一种将自然语言问题翻译为结构化SQL查询的模型，通过将SQL解码分解为聚合、SELECT和WHERE三部分并使用基于执行结果的强化学习训练，同时发布大规模手工标注的SQL问答数据集以提升评估与训练效果。",
    "quality": "High",
    "conference": null,
    "pdf_url": "https://arxiv.org/pdf/1709.00103v7",
    "published": "2017-08-31",
    "update_time": "2017-11-09",
    "download_time": "2025-12-12 21:49:12"
  }
]