[
  {
    "id": "1812.08693",
    "title": "An Empirical Study on Learning Bug-Fixing Patches in the Wild via Neural Machine Translation",
    "abstract": "Millions of open-source projects with numerous bug fixes are available in code repositories. This proliferation of software development histories can be leveraged to learn how to fix common programming bugs. To explore such a potential, we perform an empirical study to assess the feasibility of using Neural Machine Translation techniques for learning bug-fixing patches for real defects. First, we mine millions of bug-fixes from the change histories of projects hosted on GitHub, in order to extract meaningful examples of such bug-fixes. Next, we abstract the buggy and corresponding fixed code, and use them to train an Encoder-Decoder model able to translate buggy code into its fixed version. In our empirical investigation we found that such a model is able to fix thousands of unique buggy methods in the wild. Overall, this model is capable of predicting fixed patches generated by developers in 9-50% of the cases, depending on the number of candidate patches we allow it to generate. Also, the model is able to emulate a variety of different Abstract Syntax Tree operations and generate candidate patches in a split second.",
    "arxiv_url": "https://arxiv.org/abs/1812.08693",
    "authors": [
      "Michele Tufano",
      "Cody Watson",
      "Gabriele Bavota",
      "Massimiliano Di Penta",
      "Martin White",
      "Denys Poshyvanyk"
    ],
    "first_author": "Michele Tufano",
    "category": [
      "Empirical",
      "Technical"
    ],
    "field": "Quality Management",
    "task": "Bug Repair",
    "tags": [
      "Neural Machine Translation for Program Repair",
      "Method-level bug-fix pair mining from GitHub",
      "AST edit action emulation",
      "Code abstraction with idioms and identifier mapping",
      "GumTree-based fine-grained differencing",
      "RNN encoder-decoder with attention",
      "Candidate patch generation and top-k inference",
      "Syntactic correctness and edit-operation analysis"
    ],
    "summary": "本文通过在大规模GitHub修复提交中挖掘方法级错误-修复对，使用编码器-解码器的神经机器翻译模型将有缺陷代码“翻译”成修复代码，并实证评估了该方法生成与开发者等效补丁的能力与效率。",
    "quality": "High",
    "conference": "ACM Transactions on Software Engineering and Methodology 2019",
    "pdf_url": "https://arxiv.org/pdf/1812.08693v2",
    "published": "2018-12-20",
    "update_time": "2019-05-21",
    "download_time": "2025-12-11 16:57:59"
  }
]