[
  {
    "id": "1909.09436",
    "title": "CodeSearchNet Challenge: Evaluating the State of Semantic Code Search",
    "abstract": "Semantic code search is the task of retrieving relevant code given a natural language query. While related to other information retrieval tasks, it requires bridging the gap between the language used in code (often abbreviated and highly technical) and natural language more suitable to describe vague concepts and ideas.   To enable evaluation of progress on code search, we are releasing the CodeSearchNet Corpus and are presenting the CodeSearchNet Challenge, which consists of 99 natural language queries with about 4k expert relevance annotations of likely results from CodeSearchNet Corpus. The corpus contains about 6 million functions from open-source code spanning six programming languages (Go, Java, JavaScript, PHP, Python, and Ruby). The CodeSearchNet Corpus also contains automatically generated query-like natural language for 2 million functions, obtained from mechanically scraping and preprocessing associated function documentation. In this article, we describe the methodology used to obtain the corpus and expert labels, as well as a number of simple baseline solutions for the task.   We hope that CodeSearchNet Challenge encourages researchers and practitioners to study this interesting task further and will host a competition and leaderboard to track the progress on the challenge. We are also keen on extending CodeSearchNet Challenge to more queries and programming languages in the future.",
    "arxiv_url": "https://arxiv.org/abs/1909.09436",
    "authors": [
      "Hamel Husain",
      "Ho-Hsiang Wu",
      "Tiferet Gazit",
      "Miltiadis Allamanis",
      "Marc Brockschmidt"
    ],
    "first_author": "Hamel Husain",
    "category": [
      "Benchmark"
    ],
    "field": "Coding Assistant",
    "task": "Code Retrieval",
    "tags": [
      "Function-documentation pairing",
      "Semantic code retrieval",
      "Expert relevance annotations",
      "Cross-language corpus (6 languages)",
      "Heuristic preprocessing and deduplication",
      "Annotation interface and protocol",
      "NDCG ranking evaluation",
      "Neural+Elasticsearch baseline ensemble"
    ],
    "summary": "本文发布了包含约200万条函数-文档对的CodeSearchNet语料库并提出了包含99条查询与约4026条专家相关性标注的CodeSearchNet挑战，介绍了数据收集与过滤流程、注释方法及若干基线检索模型以评估语义代码搜索进展。",
    "quality": "High",
    "conference": null,
    "pdf_url": "https://arxiv.org/pdf/1909.09436v3",
    "published": "2019-09-20",
    "update_time": "2020-06-08",
    "download_time": "2025-12-11 17:06:35"
  },
  {
    "id": "1909.05378",
    "title": "CoSQL: A Conversational Text-to-SQL Challenge Towards Cross-Domain Natural Language Interfaces to Databases",
    "abstract": "We present CoSQL, a corpus for building cross-domain, general-purpose database (DB) querying dialogue systems. It consists of 30k+ turns plus 10k+ annotated SQL queries, obtained from a Wizard-of-Oz (WOZ) collection of 3k dialogues querying 200 complex DBs spanning 138 domains. Each dialogue simulates a real-world DB query scenario with a crowd worker as a user exploring the DB and a SQL expert retrieving answers with SQL, clarifying ambiguous questions, or otherwise informing of unanswerable questions. When user questions are answerable by SQL, the expert describes the SQL and execution results to the user, hence maintaining a natural interaction flow. CoSQL introduces new challenges compared to existing task-oriented dialogue datasets:(1) the dialogue states are grounded in SQL, a domain-independent executable representation, instead of domain-specific slot-value pairs, and (2) because testing is done on unseen databases, success requires generalizing to new domains. CoSQL includes three tasks: SQL-grounded dialogue state tracking, response generation from query results, and user dialogue act prediction. We evaluate a set of strong baselines for each task and show that CoSQL presents significant challenges for future research. The dataset, baselines, and leaderboard will be released at https://yale-lily.github.io/cosql.",
    "arxiv_url": "https://arxiv.org/abs/1909.05378",
    "authors": [
      "Tao Yu",
      "Rui Zhang",
      "He Yang Er",
      "Suyi Li",
      "Eric Xue",
      "Bo Pang",
      "Xi Victoria Lin",
      "Yi Chern Tan",
      "Tianze Shi",
      "Zihan Li",
      "Youxuan Jiang",
      "Michihiro Yasunaga",
      "Sungrok Shim",
      "Tao Chen",
      "Alexander Fabbri",
      "Zifan Li",
      "Luyao Chen",
      "Yuwen Zhang",
      "Shreya Dixit",
      "Vincent Zhang",
      "Caiming Xiong",
      "Richard Socher",
      "Walter S Lasecki",
      "Dragomir Radev"
    ],
    "first_author": "Tao Yu",
    "category": [
      "Benchmark"
    ],
    "field": "Natural Language Interfaces to Databases",
    "task": "Conversational Text-to-SQL (SQL-grounded dialogue state tracking, response generation from executed SQL/results, user dialogue act prediction)",
    "tags": [
      "Wizard-of-Oz data collection",
      "Cross-domain complex databases",
      "SQL-grounded dialogue state tracking",
      "Natural language response generation from SQL and results",
      "User dialogue act prediction (clarify/unanswerable)",
      "Execution-grounded annotations",
      "Unseen-database split for generalization",
      "Multi-turn conversational query interactions",
      "Baselines and public leaderboard"
    ],
    "summary": "CoSQL 提出并发布了一个大规模跨域会话式文本到 SQL 语料库（含对话、SQL 标注、系统回应与对话行为标签），并为 SQL-驱动的对话状态跟踪、基于查询结果的自然语言回复生成和用户对话行为预测等任务提供基线与挑战性评估。",
    "quality": "High",
    "conference": "EMNLP 2019",
    "pdf_url": "https://arxiv.org/pdf/1909.05378v1",
    "published": "2019-09-11",
    "update_time": "2019-09-11",
    "download_time": "2025-12-12 21:58:40"
  }
]